app/Http/Controllers/ProductController.php

    public function index()
    {
        //$products = Product::all(); // se obtienen todos los productos

        $products = Cache::remember('products', 60, function () {
            return Product::with('brand')->get();
            //se agrega eager loading para obtener la marca de cada producto, esto para evitar hacer una consulta por cada producto
            //mejora el rendimiento de la aplicación

            //la cache se guarda por 60 segundos
            //sirve para mejorar el rendimiento de la aplicación
        });
---
select * from `brands` where `brands`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9)
select * from `products`

    public function store(Request $request)
    {
        $request->validate([ // Valida los campos
            'name' => 'required',
            'description' => 'required',
            'brand_id' => 'required'
        ]);

        Product::create([ // Crea el Producto
            'name' => $request->name, // Guarda el Nombre
            'description' => $request->description, // Guarda la Descripción
            'brand_id' => $request->brand_id // Guarda la Marca
        ]);
---
insert into `products` (`name`, `description`, `brand_id`, `updated_at`, `created_at`) values ('Steven', 'waos', '1', '2024-01-03 21:48:06', '2024-01-03 21:48:06')

    public function show(string $id)
    {
        $products = Product::find($id); // se obtiene el producto con el id que se envia
---
select * from `products` where `products`.`id` = '1' limit 1

    public function edit(string $id)
    {
        $product = Product::find($id); // se obtiene el producto con el id que se envia
        $brands = Brand::all(); // se obtienen todas las marcas
---
select * from `brands`